Repository: BravoBaldo/Translations
Catalog: Node-RED/OmegaT_NodeRed/OmegaT_NodeRed-level2.tmx
Source language: en_us
Languages: it_it

source: Save the following in a file called `<node-red>/user-authentication.js`
it_it: Salvare quanto segue in un file denominato `<node-red>/user-authentication.js`

source: See [Generating the password hash](#generating-the-password-hash) for more information.
it_it: Vedere [Generazione dell'hash della passwordhash](#generating-the-password-hash) per ulteriori informazioni.

source: See below for a note on the `callbackURL` and `callbackMethod`.
it_it: Di seguito è riportata una nota su `callbackURL` e `callbackMethod`.

source: See logging section below for more details.
it_it: Per maggiori dettagli, consultare la sezione "logging" qui sotto.

source: Sending messages asynchronously
it_it: Invio di messaggi in modo asincrono

source: Set the `adminAuth` property in settings.js to load this module:
it_it: Impostare la proprietà `adminAuth` in settings.js per caricare questo modulo:

source: Set the `httpsRefreshInterval` to how often (in hours) Node-RED should call the `https` function to get updated details.
it_it: Impostare `httpsRefreshInterval` sulla frequenza (in ore) con cui Node-RED deve chiamare la funzione `https` per ottenere i dettagli aggiornati.

source: Setting a default user
it_it: Impostazione di un utente di default

source: Since Node-RED 0.19, it is also possible to get or set multiple values in one go:
it_it: A partire dalla versione 0.19 di Node-RED, è anche possibile ottenere o impostare più valori contemporaneamente:

source: Since Node-RED 1.1.0, `node-red-admin` is now built into the `node-red` command - you do not need to install it separately.
it_it: A partire da Node-RED 1.1.0, `node-red-admin` è ora integrato nel comando `node-red`: non è necessario installarlo separatamente.

source: Some stores may only provide asynchronous access and will throw an error if they are accessed synchronously.
it_it: Alcuni "store" [archivi] potrebbero fornire solo l'accesso asincrono e genereranno un errore se l'accesso avviene in modo sincrono.

source: Storing data
it_it: Memorizzazione dei dati

source: Subflows appear as regular nodes so can be used at any point in a flow.
it_it: I `Subflow` appaiono come nodi normali, quindi possono essere utilizzati in qualsiasi punto di un flusso.

source: Subscribe to the [blog](https://nodered.org/blog/)
it_it: Iscriversi al [blog](https://nodered.org/blog/)

source: Target and Login
it_it: Target e Login

source: That allows those device-specific customisations to be maintained separately to the flows that should be common to all devices.
it_it: Ciò consente di gestire le personalizzazioni specifiche del dispositivo separatamente dai flussi che dovrebbero essere comuni a tutti i dispositivi.

source: That helps somewhat, but it doesn't reveal the full purpose of the node.
it_it: Questo aiuta in qualche modo, ma non rivela lo scopo completo del nodo.

source: That is particular true if that smaller section could be reused elsewhere in the flows.
it_it: Ciò è particolarmente vero se quella sezione più piccola potesse essere riutilizzata altrove nei flussi.

source: That makes it hard to identify the right target node and mistakes can happen.
it_it: Ciò rende difficile identificare il nodo di destinazione corretto e possono verificarsi errori.

source: The Comment node can be used to add inline comments to the flow - both the node's label, but also its description that will show in the Information sidebar when selected.
it_it: Il nodo "Comment" può essere utilizzato per aggiungere commenti in linea al flusso: sia l'etichetta del nodo, sia la sua descrizione, che verrà visualizzata nella barra laterale "Information" quando selezionata.

source: The Delay node can then be configured to rate limit messages according to their topic.
it_it: Il nodo Delay può quindi essere configurato per limitare la frequenza dei messaggi in base al loro argomento.

source: The Editor and Admin API supports two types of authentication:
it_it: L'Editor e l'API di Admin supportano due tipi di autenticazione:

source: The Function can request the runtime to *not clone* the first message passed to `node.send` by passing in `false` as a second argument to the function.
it_it: La Funzione può richiedere al runtime di *non clonare* il primo messaggio passato a `node.send` passando `false` come secondo argomento alla funzione.

source: The Function node allows JavaScript code to be run against the messages that are passed through it.
it_it: Il nodo Function consente di eseguire codice JavaScript sui messaggi che lo attraversano.

source: The Function node also makes the following modules and functions available:
it_it: Il nodo Funzione rende disponibili anche i seguenti moduli e funzioni:

source: The Function node can use the `env.get()` function.
it_it: Il nodo Function può utilizzare la funzione `env.get()`.

source: The Function node will clone every message object you pass to `node.send` to ensure there is no unintended modification of message objects that get reused in the function.
it_it: Il nodo Funzione clonerà ogni oggetto messaggio passato a `node.send` per garantire che non vi siano modifiche indesiderate agli oggetti messaggio che vengono riutilizzati nella funzione.

source: The Inject and Change nodes are able to access environment variables using either the "env" option in their TypedInput.
it_it: I nodi Inject e Change possono accedere alle variabili d'ambiente utilizzando l'opzione "env" nel loro TypedInput.

source: The On Start function can return a Promise if it needs to complete asynchronous work before the main Function can start processing messages.
it_it: La funzione On Start può restituire una "Promise" se deve completare il lavoro asincrono prima che la Funzione principale possa iniziare a elaborare i messaggi.

source: The [flow structure](flow-structure) section of this guide looked at how to arrange the logical components of your flows.
it_it: La sezione [struttura del flusso](flow-structure) di questa guida ha esaminato come disporre i componenti logici dei flussi.

source: The [node-red-admin](http://npmjs.org/package/node-red-admin) command-line tool allows you to remotely administer a Node-RED instance.
it_it: Lo strumento da riga di comando [node-red-admin](http://npmjs.org/package/node-red-admin) consente di amministrare da remoto un'istanza di Node-RED.

source: The `adminAuth` setting can include a `tokens` function.
it_it: L'impostazione `adminAuth` può includere una funzione `tokens`.

source: The `callbackURL` used by a strategy is where the authentication provider will redirect to following an auth attempt.
it_it: `callbackURL` utilizzato da una strategia è il punto a cui il provider di autenticazione reindirizzerà dopo un tentativo di autenticazione.

source: The `get`/`set` context functions accept an optional parameter to identify the store to use.
it_it: Le funzioni di contesto `get`/`set` accettano un parametro opzionale per identificare l'archivio da utilizzare.

source: The `httpNodeAuth` property in your `settings.js` file can be used to define a single username and password that will be allowed to access the routes.
it_it: La proprietà `httpNodeAuth` nel file `settings.js` è utilizzabile per definire un singolo nome utente e una password che saranno autorizzati ad accedere alle rotte.

source: The `https` function should determine if the current certificates will expire within the next `httpsRefreshInterval` period, and if so, generate a new set of certificates.
it_it: La funzione `https` deve determinare se i certificati correnti scadranno entro il prossimo periodo `httpsRefreshInterval` e, in tal caso, generare un nuovo set di certificati.

source: The `https` option can be either a static set of configuration options, or, since Node-RED 1.1.0, a function that returns the options.
it_it: L'opzione `https` può essere un insieme statico di opzioni di configurazione oppure, a partire da Node-RED 1.1.0, una funzione che restituisce le opzioni.

source: The `https` setting *must* be a Function that can be called to get the updated certificates
it_it: L'impostazione `https` *deve* essere una Funzione che può essere chiamata per ottenere i certificati aggiornati

source: The `pass` property uses the same format as `adminAuth`.
it_it: La proprietà `pass` utilizza lo stesso formato di `adminAuth`.

source: The `strategy` property takes the following options:
it_it: La proprietà `strategy` accetta le seguenti opzioni:

source: The `users` property is an array of user objects.
it_it: La proprietà `users` è un array di oggetti utente.

source: The `warn` and `error` messages also get sent to the debug tab on the right side of the flow editor.
it_it: I messaggi `warn` e `error` vengono inviati anche alla tab di debug sul lato destro dell'editor di flusso.

source: The approach that gives the greatest legibility is to keep each unit of processing on a single horizontal line wherever possible.
it_it: L'approccio che garantisce la massima leggibilità è quello di mantenere ogni unità di elaborazione su un'unica linea orizzontale, ove possibile.

source: The asynchronous version of the count example becomes:
it_it: La versione asincrona dell'esempio "count" diventa:

source: The background colour of each group can also be used to highlight different types of group.
it_it: Il colore di sfondo di ciascun gruppo può essere utilizzato anche per evidenziare diversi tipi di gruppo.

source: The built-in context stores provide both modes.
it_it: I "context store" integrati forniscono entrambe le modalità.

source: The code entered into the Function node represents the *body* of the function.
it_it: Il codice inserito nel nodo Function rappresenta il *corpo* della funzione.

source: The context can be scoped to the same tab, subflow or made available globally.
it_it: Il contesto può essere limitato alla stessa scheda, `Subflow` o reso disponibile a livello globale.

source: The database node will put its result in the payload of the message it sends - overwriting the original id value.
it_it: Il nodo del database inserirà il risultato nel payload del messaggio inviato, sovrascrivendo il valore ID originale.

source: The default Node-RED settings file includes a commented out `https` section that can be used to load the certificates from local files.
it_it: Il file delle impostazioni di default di Node-RED include una sezione `https` commentata utilizzabile per caricare i certificati dai file locali.

source: The editor will store that token locally and use it for all future requests.
it_it: L'editor memorizzerà il token localmente e lo utilizzerà per tutte le richieste future.

source: The editor's default behaviour of snapping nodes to a grid on the tab helps keep them aligned.
it_it: Il comportamento predefinito dell'editor, che prevede l'aggancio dei nodi a una griglia sulla scheda, aiuta a mantenerli allineati.

source: The example configuration above will prevent anyone from accessing the editor unless they log in.
it_it: La configurazione di esempio sopra impedirà a chiunque di accedere all'editor a meno che non effettui il login.

source: The expiration time can be customised by setting the `sessionExpiryTime` property of the `adminAuth` setting.
it_it: Il tempo di scadenza può essere personalizzato impostando la proprietà `sessionExpiryTime` dell'impostazione `adminAuth`.

source: The first argument passed to the callback, `err`, is only set if an error occurred when accessing context.
it_it: Il primo argomento passato alla callback, `err`, viene impostato solo se si è verificato un errore durante l'accesso al contesto.

source: The flows can be read in the workspace to see the logical flow of events.
it_it: I flussi possono essere letti nell'area di lavoro per visualizzare il flusso logico degli eventi.

source: The following example maintains a count of how many times the function has been run:
it_it: L'esempio seguente mantiene un conteggio del numero di volte in cui la funzione è stata eseguita:

source: The following example passes the original message as-is on the first output and a message containing the payload length is passed to the second output:
it_it: L'esempio seguente passa il messaggio originale così com'è sul primo output e un messaggio contenente la lunghezza del payload viene passato al secondo output:

source: The following example shows how an external module can be used to provide the custom authentication code.
it_it: L'esempio seguente mostra come utilizzare un modulo esterno per fornire il codice di autenticazione personalizzato.

source: The following example shows how to configure to authenticate against Twitter _without_ using the auth module we provide.
it_it: L'esempio seguente mostra come configurare l'autenticazione su Twitter _senza_ utilizzare il modulo di autenticazione che forniamo.

source: The following example splits the received payload into individual words and returns a message for each of the words.
it_it: L'esempio seguente suddivide il payload ricevuto in singole parole e restituisce un messaggio per ciascuna parola.

source: The following examples use `flow` context, but apply equally well to `context` and `global`.
it_it: Gli esempi seguenti utilizzano il contesto `flow`, ma si applicano ugualmente bene a `context` e a `global`.

source: The following objects are available within the Function node.
it_it: I seguenti oggetti sono disponibili all'interno del nodo Funzione.

source: The following setting is an example to limit the HTTP access rate in http-in nodes.
it_it: L'impostazione seguente è un esempio per limitare la velocità di accesso HTTP nei nodi http-in.

source: The full set of options are [documented here](https://nodejs.org/api/tls.html#tls_tls_createsecurecontext_options).
it_it: Il set completo di opzioni è [documentato qui](https://nodejs.org/api/tls.html#tls_tls_createsecurecontext_options).

source: The function can optionally return a Promise that will resolve to the options object, allowing it to complete asynchronously.
it_it: La funzione può facoltativamente restituire una "Promise" che verrà risolta nell'oggetto opzioni, consentendone il completamento in modo asincrono.

source: The function edit dialog allows the number of outputs to be changed.
it_it: La finestra di dialogo di modifica della funzione consente di modificare il numero di output.

source: The function must always return a msg object.
it_it: La funzione deve sempre restituire un oggetto msg.

source: The function node can also provide it's own status decoration in the same way that other nodes can.
it_it: Il nodo funzione può anche fornire la propria decorazione di stato, proprio come fanno gli altri nodi.

source: The global context can be pre-populated with objects when Node-RED starts.
it_it: Il contesto globale può essere precompilato con oggetti all'avvio di Node-RED.

source: The goal is to make it easy to follow the flow without having to jump around the workspace or have to follow multiple wires that cross each other and appear tangled.
it_it: L'obiettivo è semplificare la consultazione del flusso senza dover saltare da un'area di lavoro all'altra o seguire più fili che si incrociano e appaiono aggrovigliati.

source: The goal should be to make it easy to “read” an individual flow from start to finish.
it_it: L'obiettivo dovrebbe essere quello di semplificare la "lettura" di un singolo flusso dall'inizio alla fine.

source: The longer the label, the more space it needs in the flow.
it_it: Più lunga è l'etichetta, maggiore è lo spazio di cui ha bisogno nel flusso.

source: The main method of organising flows in Node-RED is by separating them across multiple tabs within the editor.
it_it: Il metodo principale per organizzare i flussi in Node-RED è separarli in più schede all'interno dell'editor.

source: The message is passed in as an object called `msg`.
it_it: Il messaggio viene passato come un oggetto chiamato `msg`.

source: The messages that pass through a flow are plain JavaScript objects that can have properties set on them.
it_it: I messaggi che attraversano un flusso sono semplici oggetti JavaScript a cui è possibile impostare delle proprietà.

source: The modules are automatically installed under `~/.node-red/node_modules/` when the node is deployed.
it_it: I moduli vengono installati automaticamente in `~/.node-red/node_modules/` quando il nodo viene distribuito.

source: The most simple function simply returns the message exactly as-is:
it_it: La funzione più semplice restituisce semplicemente il messaggio esattamente così com'è:

source: The names should clearly identify the start and end point of each flow.
it_it: I nomi dovrebbero identificare chiaramente il punto di inizio e di fine di ciascun flusso.

source: The other called `george` who is given read-only access.
it_it: L'altro chiamato `george`, a cui viene concesso l'accesso in sola lettura.

source: The permission model is resource based.
it_it: Il modello di autorizzazione è basato sulle risorse.

source: The returned message object does not need to be same object as was passed in; the function can construct a completely new object before returning it.
it_it: L'oggetto messaggio restituito non deve necessariamente essere lo stesso oggetto passato; la funzione può costruire un oggetto completamente nuovo prima di restituirlo.

source: The routes exposed by the HTTP In nodes can be secured using basic authentication.
it_it: Le "route" [rotte] esposte dai nodi "HTTP In" possono essere protette utilizzando l'autenticazione di base.

source: The same approach can be used when the flows might run on different operating systems - where the path to a file used by the flows may be different depending on the OS.
it_it: Lo stesso approccio può essere utilizzato quando i flussi potrebbero essere eseguiti su sistemi operativi diversi, dove il percorso a un file utilizzato dai flussi potrebbe essere diverso a seconda del sistema operativo.

source: The security is split into three parts:
it_it: La sicurezza è suddivisa in tre parti:

source: The shorter the label, the less information it can share.
it_it: Più corta è l'etichetta, minori sono le informazioni che può condividere.

source: The tool provides the following commands:
it_it: Lo strumento fornisce i seguenti comandi:

source: Then add `MY_TOPIC` as a subflow property.
it_it: Quindi aggiungere `MY_TOPIC` come proprietà del `Subflow`.

source: There are a few different strategies that can be used to do that.
it_it: Esistono diverse strategie utilizzabili a questo scopo.

source: There are some important differences between the two approaches.
it_it: Esistono alcune importanti differenze tra i due approcci.

source: There are two modes for accessing context; either synchronous or asynchronous.
it_it: Esistono due modalità per accedere al contesto: sincrona o asincrona.

source: There is a balance to be considered here.
it_it: C'è un compromesso da considerare.

source: There is not a single right answer to how to structure the message, but it should focus on how the node or flow is going to be used in the most common cases.
it_it: Non esiste una risposta univoca su come strutturare il messaggio, ma è importante concentrarsi su come il nodo o il flusso verrà utilizzato nei casi più comuni.

source: These are properties that can be set on the subflow instance and appear as environment variables inside the subflow.
it_it: Si tratta di proprietà che possono essere impostate sull'istanza del `Subflow` e che appaiono come variabili di ambiente al suo interno.

source: These commands create a file called `~/.node-red/.cli-config.json` that stores the target and access token information.
it_it: Questi comandi creano un file denominato `~/.node-red/.cli-config.json` che memorizza le informazioni relative al target e al token di accesso.

source: They can also be connected to more than one other link node.
it_it: Possono anche essere collegati a più di un altro "Link Node".

source: They can be used within a single tab to help flows wrap across the workspace without having lots of wires crossing from right to left.
it_it: Possono essere utilizzati all'interno di una singola scheda per aiutare i flussi a scorrere nell'area di lavoro senza troppi collegamenti che si incrociano da destra a sinistra.

source: They can help quickly identify the purpose of each branch in the flow.
it_it: Possono aiutare a identificare rapidamente lo scopo di ogni ramo del flusso.

source: They can only be used to start or end a flow.
it_it: Possono essere utilizzati solo per avviare o terminare un flusso.

source: They must be loaded in your *settings.js* file and added to the `functionGlobalContext` property.
it_it: Devono essere caricati nel file *settings.js* e aggiunti alla proprietà `functionGlobalContext`.

source: They should also avoid commonly used properties such as `reset` and `parts` that have special meaning with some nodes.
it_it: Dovrebbero anche evitare proprietà di uso comune come `reset` e `parts`, che hanno un significato speciale per alcuni nodi.

source: They should be self-describing to help with later debugging and understanding of the flow.
it_it: Dovrebbero essere autodescrittivi per facilitare il debug e la comprensione del flusso in seguito.

source: They usually have a `payload` property - this is the default property that most nodes will work with.
it_it: Di solito hanno una proprietà `payload`, che è la proprietà di default con cui la maggior parte dei nodi funzionerà.

source: They wrap up some of the strategy-specific detail to make it easier to use.
it_it: Riassumono alcuni dettagli specifici della strategia per renderla più facile da usare.

source: This allows you to define multiple users, each of whom can have different permissions.
it_it: Questo consente di definire più utenti, ognuno dei quali può avere autorizzazioni diverse.

source: This applies to flows as well.
it_it: Questo vale anche per i flussi.

source: This can be a great way to get started, but as flows grow over time, it can lead to applications that are harder to maintain.
it_it: Questo può essere un ottimo modo per iniziare, ma con la crescita dei flussi nel tempo, può portare ad applicazioni più difficili da gestire.

source: This can be used to [load additional modules](#loading-additional-modules) within the Function node.
it_it: Può essere utilizzato per [caricare moduli aggiuntivi](#loading-additional-modules) all'interno del nodo Funzione.

source: This can be used to control how the editor is embedded on other pages.
it_it: Questo può essere utilizzato per controllare il modo in cui l'editor è racchiuso in altre pagine.

source: This can be used to setup any state the Function node requires.
it_it: Questo può essere utilizzato per impostare qualsiasi stato richiesto dal nodo Funzione.

source: This defines, in seconds, how long a token is valid for.
it_it: Questo definisce, in secondi, la durata di validità di un token.

source: This documentation is then displayed in the [Information sidebar](/docs/user-guide/editor/sidebar/info) when the item is selected.
it_it: Questa documentazione viene poi visualizzata nella [Barra laterale Information](/docs/user-guide/editor/sidebar/info) quando l'elemento viene selezionato.

source: This example configuration above defines two users.
it_it: La configurazione di esempio sopra definisce due utenti.

source: This function will be called if a request to the admin api does not contain an authentication token that Node-RED recognises as one of its own.
it_it: Questa funzione verrà chiamata se una richiesta all'API di Admin non contiene un token di autenticazione che Node-RED riconosce come proprio.
